# function that takes age
#
# Написати функцію, котра має прийняти вік (ціле число), і якщо
#
# вік менше 0 - повернути стрічку з повідомленням, що передано не валідне значення віку, оскільки вік не може бути менше 0
# вік від 1 включно до 18 включно - повернути  повідомлення, що користувач є дитиною
# вік від 19 до 65 включно - повернути повідомлення, що потрібно працювати
# понад 65 - повернути повідомлення з побажанням щасливої пенсії
# написати тести для даної функції (4 кейса - тому 4 функції)

def age_function(user_age: int) -> str:
    if user_age < 0:
        return 'Invalid age value passed'
    elif user_age <= 18:
        return 'The user is a child'
    elif user_age <= 65:
        return 'you need to work'
    else:
        return 'have a good old age'
